<a href="https://colab.research.google.com/github/NandhithaMilkuri/Batch20_1352_PDS/blob/main/Lab4_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
data=[10,20,30,40,50]
series=pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
import pandas as pd
data=[10,20,30,40,50]
series=pd.Series(data,index=['a','b','c','d','e'])
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [ ]:
import pandas as pd
data={
    'Name':['Alice','Bob','Charlie','David'],
    'Age':[25,30,35,40],
    'City':['Hyderabad','Delhi','chennai','Mumbai']
}
df=pd.DataFrame(data)
print(df)

      Name  Age       City
0    Alice   25  Hyderabad
1      Bob   30      Delhi
2  Charlie   35    chennai
3    David   40     Mumbai

In [ ]:
print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [ ]:
print(df[['Name','City']])

      Name       City
0    Alice  Hyderabad
1      Bob      Delhi
2  Charlie    chennai
3    David     Mumbai

In [ ]:
print(df.iloc[1])

Name      Bob
Age        30
City    Delhi
Name: 1, dtype: object

In [ ]:
print(df.loc[2])

Name    Charlie
Age          35
City    chennai
Name: 2, dtype: object

In [ ]:
df['Salary']=[40000,50000,60000,70000]
print(df)

      Name  Age       City  Salary
0    Alice   25  Hyderabad   40000
1      Bob   30      Delhi   50000
2  Charlie   35    chennai   60000
3    David   40     Mumbai   70000

In [ ]:
df=df.drop('City',axis=1)
print(df)

      Name  Age  Salary
0    Alice   25   40000
1      Bob   30   50000
2  Charlie   35   60000
3    David   40   70000

In [ ]:
print(df[df['Age']>30])

      Name  Age  Salary
2  Charlie   35   60000
3    David   40   70000

In [ ]:
print(df['Age'].mean())
print(df['Age'].max())
print(df['Age'].min())

32.5
40
25

In [3]:
import pandas as pd
student_data={
    'student_id':[1,2,3,4,5],
    'name':['Alice','Bob','Charlie','David','Eve'],
    'Marks':[85,92,78,95,88]
}
df=pd.DataFrame(student_data)
print(df)

   student_id     name  Marks
0           1    Alice     85
1           2      Bob     92
2           3  Charlie     78
3           4    David     95
4           5      Eve     88